{
    "scrolls": {
        "scroll-alleyesonme": {
            "name": "Scroll of All Eyes On Me",
            "description": "Ever dreamed of being the star of your own personal flash mob? \"All Eyes On Me\" is the spell for you! As a charm bard's secret weapon, this incantation turns you into a one-person show-stopper. ",
            "effect": "Forces all creatures within line of sight to focus their attention on the caster. The effectiveness of the spell increases with the quality of the caster's singing.",
            "range": "Line of sight",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "The duration of the song (minimum 6 seconds)",
            "manapointcost": "0 AP (does not cost mana to cast)",
            "cooldown": "1 minute",
            "scaling": "Level 5: Affects targets even if they can't hear the caster (lip-reading counts!)<br>Level 10: Targets find it difficult to look away or focus on anything else<br>Level 15: Targets are compelled to join in, creating a spontaneous musical number ",
            "spellcastingmodifier": "Charisma"
        },
        "scroll-astralpaw": {
            "name": "Scroll of Astral Paw",
            "description": "Ever wished you could reach that cookie jar on the top shelf without getting off the couch? Well, now you can! Astral Paw conjures a spectral appendage that's part ghostly hand, part feline fury. ",
            "effect": " Summons a spectral paw that can manipulate objects at a distance. The paw can be used to interact with items, attack enemies, or perform simple tasks. ",
            "range": " 10 meters at level 1, increasing with spell level ",
            "damageamount": "1d6 + Spellcasting Modifier",
            "damagetype": "Force",
            "castingtime": "Instantaneous",
            "manapointcost": "3 MP",
            "cooldown": "1 turn",
            "scaling": "Level 5: Paw can grow claws, increasing damage to 2d6 + Spellcasting Modifier<br>Level 10: Paw can be made much larger, increasing range to 20 meters and damage to 3d6 + Spellcasting Modifier<br>Level 15: Caster's skills and abilities are translated directly into the paw, allowing for more complex manipulations and increasing damage to 4d6 + Spellcasting Modifier ",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-badattitude": {
            "name": "Scroll of Bad Attitude",
            "description": "Ever met someone so grumpy they could curdle milk with a glance? Well, now you can be that someone! \"Bad Attitude\" is like weaponized teen angst mixed with a sprinkle of DMV employee frustration. ",
            "effect": " Lowers the target's intelligence and resistance to other effects. Similar to the fear spell, but targets mental faculties instead of physical abilities. ",
            "range": "30 feet",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "Instantaneous",
            "manapointcost": "2 MP",
            "cooldown": "1 turn",
            "scaling": "Level 5: Affects multiple targets in a 15-foot radius<br>Level 10: Also reduces target's wisdom and charisma<br>Level 15: Creates an aura of negativity, affecting all enemies who enter within 10 feet of the caster ",
            "spellcastingmodifier": "Manipulation"
        },
        "scroll-bangbro": {
            "name": "Scroll of Bang Bro",
            "description": "Who says you can't bring the Fourth of July to a sword fight? Bang Bro is like giving your weapon a Taco Bell value meal and a gallon of energy drink.",
            "effect": "Temporarily enchants an equipped item with both fire and electrical damage. Can inflict Burn and Shock status effects on targets.",
            "range": "Touch",
            "damageamount": "Additional 1d6 fire damage and 1d6 lightning damage",
            "damagetype": "Fire and Lightning",
            "castingtime": "Instantaneous",
            "manapointcost": "5 MP",
            "cooldown": "5 minutes",
            "scaling": "Level 5: Increased damage (2d6 fire, 2d6 lightning) and higher chance to inflict status effects<br>Level 10: Can enchant two items simultaneously<br>Level 15: Adds chain lightning effect to electrical damage ",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-bitch,what": {
            "name": "Scroll of Bitch, What? ",
            "description": "You ever seen an angry, on-fire weasel tossed into a room full of chickens? You catch on fire. You are invulnerable to blunt damage. Then you get really angry and kill every goddamn thing in the room. ",
            "effect": " Caster bursts into flames, becomes invulnerable to blunt damage, and enters a berserk state, attacking everything in sight. ",
            "range": "Self",
            "damageamount": "3d10 fire damage to all creatures within 5 feet",
            "damagetype": "Fire",
            "castingtime": "Instantaneous",
            "manapointcost": "Item based",
            "cooldown": "30 hours",
            "scaling": "Level 5: Increase duration to 30 seconds<br>Level 10: Add 2d10 force damage to attacks while berserk<br>Level 15: Extend invulnerability to piercing damage",
            "spellcastingmodifier": "Stamina"
        },
        "scroll-blacknimbus": {
            "name": "Scroll of Black Nimbus",
            "description": "Has the same effect as wearing a shirt for the band Cattle Decapitation to church. Instantly removes target from the blessing of their deity and all associated buffs and effects.",
            "effect": " Removes divine blessings and buffs from the target, prevents them from entering sacred spaces, and may invoke divine punishment. ",
            "range": "30 feet",
            "damageamount": "Potential divine smite damage (DM's discretion)",
            "damagetype": "Radiant or Necrotic (depending on deity)",
            "castingtime": "Instantaneous",
            "manapointcost": "Item based",
            "cooldown": "1 hour",
            "scaling": "Level 5: Increase duration by 50%<br>Level 10: Affect multiple targets within a 15-foot radius<br>Level 15: 25% chance to invoke immediate divine smite",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-bookburner": {
            "name": "Scroll of Book Burner",
            "description": "Ever wanted to be the ultimate party pooper at a wizard's convention? Book Burner is like a magical eraser for the mind, wiping away spells faster than a teenager clears their browser history when mom walks in. ",
            "effect": "Forces an opponent to forget a specific spell for a period of time.",
            "range": "60 feet",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "Instantaneous",
            "manapointcost": "4 MP",
            "cooldown": "24 hours",
            "scaling": "Level 5: Can target spells up to 2 levels higher than the caster<br>Level 10: Duration increases to 48 hours<br>Level 15: Can make the target forget two spells simultaneously",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-braindreeze": {
            "name": "Scroll of Brain Dreeze",
            "description": "Ever chugged a slushie too fast and felt that icy pain shoot through your skull? Now you can inflict that joy on your enemies!",
            "effect": "Drains the target's health and potentially causes temporary blindness at higher levels.",
            "range": "30 feet",
            "damageamount": "2d8 psychic damage",
            "damagetype": "Psychic",
            "castingtime": "Instantaneous",
            "manapointcost": "3 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Increase damage to 3d8 and adds a slowing effect<br>Level 10: 50% chance to cause blindness for 1 round<br>Level 15: Damage increases to 4d8 and blindness chance increases to 75%",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-butchersmasquerade": {
            "name": "Scroll of Butcher's Masquerade",
            "description": "Ever tried to host a dinner party for your sworn enemies? The Butcher's Masquerade is like the ultimate cosmic mixer, where the guest list is curated by a mischievous deity with a twisted sense of humor.",
            "effect": " Creates a supernatural party with a divinely enforced peace agreement. Attendees cannot harm each other unless in self-defense. If the party concludes peacefully, all guests receive a boon from Apito. If the peace is broken, the offender is fed to the Nothing. ",
            "range": "Affects an entire area (size determined by caster's level)",
            "damageamount": "N/A (but breaking the rules results in obliteration)",
            "damagetype": "N/A",
            "castingtime": "1 hour",
            "manapointcost": "50 MP",
            "cooldown": "Can only be cast once in a lifetime",
            "scaling": "Level 5: Increase area of effect and number of guests<br>Level 10: Add magical entertainment that boosts the chance of peace<br>Level 15: Extend duration to 48 hours and add cosmic catering",
            "spellcastingmodifier": "Charisma"
        },
        "scroll-camouflage": {
            "name": "Scroll of Camouflage",
            "description": "Ever wished you could just disappear during awkward social situations? Camouflage is like the magical version of hiding behind a potted plant at a party, but way more effective. ",
            "effect": "Conceals the caster's dot on the Minimap as long as they remain stationary.",
            "range": "Self",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "Instantaneous",
            "manapointcost": "2 MP",
            "cooldown": "5 minutes",
            "scaling": "Level 5: Caster can make small movements without breaking the effect<br>Level 10: Extends concealment to a 5-foot radius around the caster<br>Level 15: Allows the caster to move at half speed while maintaining the effect",
            "spellcastingmodifier": "Dexterity"
        },
        "scroll-clockworktriplicate": {
            "name": "Scroll of Clockwork Triplicate",
            "description": "Ever wanted to be in three places at once? Clockwork Triplicate is like the magical version of copy-and-paste, but for people! ",
            "effect": "Creates two independent duplicates of the caster that act autonomously.",
            "range": "Self",
            "damageamount": "Minor damage from exploding replicas if spell ends prematurely",
            "damagetype": "Piercing",
            "castingtime": "1 action",
            "manapointcost": "5 MP",
            "cooldown": "1 hour",
            "scaling": "Level 5: Duration increases to 2 minutes per spell level<br>Level 10: Replicas can cast spells known by the caster<br>Level 15: Replicas gain 50% of the caster's hit points",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-cloudofexhaust": {
            "name": "Scroll of Cloud of Exhaust",
            "description": "Ever wondered what it would be like to weaponize that feeling you get after eating a triple bean burrito? Cloud of Exhaust is like a magical dutch oven, filling the air with a noxious cloud that would make even a skunk hold its nose. ",
            "effect": "Creates a noxious cloud that knocks out targets and makes them vulnerable to follow-up attacks.",
            "range": "30-foot radius centered on a point within 60 feet",
            "damageamount": " No initial damage, but subsequent attacks deal an extra 1d6 damage for 30 seconds ",
            "damagetype": "Poison (for the extra damage)",
            "castingtime": "1 action",
            "manapointcost": "4 MP",
            "cooldown": "10 minutes",
            "scaling": "Level 5: Increase radius to 40 feet<br>Level 10: Targets remain vulnerable for 1 minute after waking<br>Level 15: Cloud becomes mobile, following caster's mental commands ",
            "spellcastingmodifier": "Stamina"
        },
        "scroll-communitypool": {
            "name": "Scroll of Community Pool",
            "description": "Ever wished you could share your nasty cold with that annoying coworker? Community Pool is like a magical game of hot potato, but instead of a spud, you're passing around that weird rash you got from sitting on a public toilet. ",
            "effect": "Transfers an infection or condition from one target to another.",
            "range": "Touch (must be touching both targets)",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "6 MP",
            "cooldown": "24 hours",
            "scaling": "Level 5: Can transfer beneficial conditions as well<br>Level 10: Can affect targets up to 5 feet away<br>Level 15: Can transfer multiple conditions at once",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-confusingfog": {
            "name": "Scroll of Confusing Fog",
            "description": "Ever wanted to recreate the experience of trying to find your car in a parking garage, but in combat? Confusing Fog is like a magical vape pen for the battlefield, filling the air with a thick, wet mist that would make London jealous. ",
            "effect": " Creates a thick, disorienting fog that blinds enemies but allows allies to see through it. ",
            "range": "30-foot radius centered on a point within 60 feet",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "3 MP",
            "cooldown": "5 minutes",
            "scaling": "Level 5: Increase radius to 40 feet<br>Level 10: Fog becomes mildly acidic, dealing 1d4 acid damage per round to enemies<br>Level 15: Duration increases to Intelligence x 10 seconds ",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-disrupter": {
            "name": "Scroll of Disrupter",
            "description": "Ever wanted to be the magical equivalent of a bull in a china shop? Disrupter is like a mystical wrecking ball, perfect for when subtlety is overrated and you just want to make things go boom. ",
            "effect": "Fires a powerful energy bolt that causes significant damage and has a chance to stun targets.",
            "range": "30 feet",
            "damageamount": "3d10 force damage",
            "damagetype": "Force",
            "castingtime": "1 action",
            "manapointcost": "5 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Increase range to 45 feet and damage to 4d10<br>Level 10: Add 2d6 thunder damage and increase stun chance to 25%<br>Level 15: Bolt can pierce through up to 3 targets in a line",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-fear": {
            "name": "Scroll of Fear",
            "description": "Ever wanted to be the living embodiment of that creepy clown from your childhood nightmares? Fear is like a magical horror movie marathon injected directly into your enemy's brain.",
            "effect": " Instills overwhelming fear in the target, causing them to flee or become paralyzed with terror. ",
            "range": "30 feet",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "3 MP",
            "cooldown": "1 turn",
            "scaling": "Level 5: Affects groups of enemies in a 15-foot radius<br>Level 10: 2% chance to paralyze the target<br>Level 15: Can be cast on a wide area, affecting all enemies within 30 feet ",
            "spellcastingmodifier": "Charisma"
        },
        "scroll-firefingers": {
            "name": "Scroll of Fire Fingers",
            "description": "Ever wanted to be a human flamethrower without the bulky equipment? Fire Fingers is like having a portable BBQ at your fingertips - literally!",
            "effect": "Allows the caster to shoot fire from their fingertips or ignite their fingers for melee combat.",
            "range": "30 feet (ranged) or Touch (melee)",
            "damageamount": "2d6 fire damage",
            "damagetype": "Fire",
            "castingtime": "1 bonus action",
            "manapointcost": "3 MP",
            "cooldown": "1 turn",
            "scaling": "Level 5: Increase damage to 3d6 and range to 40 feet<br>Level 10: Can ignite objects at a distance<br>Level 15: Create a continuous stream of fire (4d6 damage per round)",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-fireball": {
            "name": "Scroll of Fireball",
            "description": "Ah, the classic Fireball - for when you absolutely, positively need to roast everything in the room. It's like a magical microwave for your enemies, but instead of a gentle 'ding', you get a glorious 'BOOM!' ",
            "effect": " Hurls a slow-moving orb of fire that explodes on impact, damaging all creatures in the area. ",
            "range": "150 feet",
            "damageamount": "8d6 fire damage",
            "damagetype": "Fire",
            "castingtime": "1 action",
            "manapointcost": "5 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Increase damage to 10d6 and radius to 30 feet<br>Level 10: Orb leaves a trail of fire that lasts for 1 round<br>Level 15: Can be set to explode on a timer or specific trigger",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-getoutofjail": {
            "name": "Scroll of Get Out of Jail",
            "description": "Feeling a bit stuck? Paralyzed with indecision (or, you know, actual paralysis)? Get Out of Jail is like a magical \"Get Out of Jail Free\" card, but instead of Monopoly, you're playing \"Don't Get Eaten by the Monster.\" ",
            "effect": "Instantly removes the stunned condition from the target.",
            "range": "Touch",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 bonus action",
            "manapointcost": "2 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Can target a creature up to 30 feet away<br>Level 10: Also removes the paralyzed and restrained conditions<br>Level 15: Can affect all allies within a 15-foot radius",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-graupel": {
            "name": "Scroll of Graupel",
            "description": "Ever wanted to combine the joy of a snowball fight with the destruction of a hailstorm? Graupel is like ordering a snow cone from Thor himself!",
            "effect": " Summons a massive hailstorm that pelts the area with fist-sized ice chunks, damaging and potentially stunning targets. ",
            "range": "100-foot radius centered on the caster",
            "damageamount": "6d8 bludgeoning damage",
            "damagetype": "Bludgeoning and Cold",
            "castingtime": "1 action",
            "manapointcost": "50 MP",
            "cooldown": "1 week",
            "scaling": "Level 5: Increase damage to 8d8 and add difficult terrain due to ice buildup<br>Level 10: Storm becomes electrically charged, adding 2d6 lightning damage<br>Level 16: Storm becomes deafening and obscures vision, imposing disadvantage on all rolls for non-allies in the area ",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-hanzo": {
            "name": "Scroll of Hanzo",
            "description": "Ever wished you could be a human magnet, but only for your enemies? Hanzo is like having your own personal tractor beam, except instead of tractors, you're beaming in angry monsters! ",
            "effect": "Pulls targeted creatures towards the caster with an irresistible force.",
            "range": "60 feet",
            "damageamount": "1d6 bludgeoning damage on impact",
            "damagetype": "Bludgeoning",
            "castingtime": "1 action",
            "manapointcost": "4 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Can target up to 3 creatures at once<br>Level 10: Increase range to 90 feet and damage to 2d6<br>Level 15: Creatures pulled take additional 2d6 force damage and are stunned for 1 round",
            "spellcastingmodifier": "Strength"
        },
        "scroll-hastenpoison": {
            "name": "Scroll of Hasten Poison",
            "description": "Ever felt like waiting for poison to take effect is just too darn slow? Hasten Poison is like hitting the fast-forward button on your favorite venomous concoction.",
            "effect": "Accelerates and intensifies the effects of poisons on the target.",
            "range": "Touch",
            "damageamount": "Doubles poison damage for the next minute",
            "damagetype": "Poison",
            "castingtime": "1 bonus action",
            "manapointcost": "3 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Can affect poisons on targets up to 30 feet away<br>Level 10: Triples poison damage instead of doubling<br>Level 15: Also applies the poisoned condition if not already present",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-healcritter": {
            "name": "Scroll of Heal Critter",
            "description": "Got a pet that's more \"ouch\" than \"meow\"? Heal Critter is like a magical band-aid for your furry (or scaly, or slimy) friends! ",
            "effect": "Instantly heals a pet-class mob or dungeon familiar.",
            "range": "Touch",
            "damageamount": "N/A (Healing: 2d8 + spellcasting modifier)",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "2 AP (0 if cast from a scroll)",
            "cooldown": "1 minute",
            "scaling": "Level 5: Increase healing to 3d8 + spellcasting modifier<br>Level 10: Can target a critter up to 30 feet away<br>Level 15: Also removes one negative condition (poisoned, paralyzed, etc.) ",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-hole": {
            "name": "Scroll of Hole",
            "description": "Ever wanted to be a human Swiss cheese maker, but for walls? Hole is like having a magical hole punch that works on anything! ",
            "effect": "Creates a temporary cylindrical hole in any surface.",
            "range": "30 feet",
            "damageamount": " N/A (but can be used for \"portal cuts\" on enemies) ",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "Variable (1 AP per second of duration)",
            "cooldown": "None",
            "scaling": "Level 1: 3cm depth per spell level<br>Level 5: Can adjust hole diameter at will<br>Level 10: Can create non-cylindrical shapes<br>Level 15: Can create holes in magical or reinforced surfaces",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-ineedmypersonalspace": {
            "name": "Scroll of I Need My Personal Space",
            "description": "Ever been stuck in a crowded elevator with a bunch of sweaty orcs? \"I Need My Personal Space\" is like a magical forcefield for the socially anxious! ",
            "effect": "Creates a powerful shockwave that pushes all creatures away from the caster.",
            "range": "15-foot radius centered on the caster",
            "damageamount": "2d6 force damage",
            "damagetype": "Force",
            "castingtime": "1 bonus action",
            "manapointcost": "4 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Increase radius to 20 feet and damage to 3d6<br>Level 10: Knocked-back creatures are also stunned for 1 round<br>Level 15: Caster can choose to exclude certain targets from the effect",
            "spellcastingmodifier": "Charisma"
        },
        "scroll-inkmarauder": {
            "name": "Scroll of Ink Marauder",
            "description": "Ever wished your doodles could come to life and do your bidding? Ink Marauder is like having a magical photocopier that spits out minions instead of TPS reports!",
            "effect": "Brings drawn creatures to life as Blood and Ink Elementals to serve the caster.",
            "range": " Touch (for drawings), Self (for tattoos) ",
            "damageamount": "Varies based on the created elemental",
            "damagetype": "Varies",
            "castingtime": "1 minute",
            "manapointcost": "5 AP + blood sacrifice",
            "cooldown": "24 hours",
            "scaling": "Level 5: Can create multiple elementals at once<br>Level 10: Elementals gain resistance to non-magical weapons<br>Level 15: Can create 3D, fully-realized versions of drawn creatures ",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-laundryday": {
            "name": "Scroll of Laundry Day",
            "description": "There are a lot of angry souls out there. Like, a lot. It's said if one has the ability to actually see all the wailing souls that filter through the edges of our world, one would go quite insane. ",
            "effect": " Animates recently unequipped armor or weapons with angry spirits, turning them into temporary minions. ",
            "range": "Touch",
            "damageamount": "Varies based on the animated item",
            "damagetype": "Varies",
            "castingtime": "1 action",
            "manapointcost": "25 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Can animate multiple items at once<br>Level 10: Animated items gain resistances based on their material<br>Level 15: Can animate items worn or wielded by enemies",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-magicmissile": {
            "name": "Scroll of Magic Missile",
            "description": " Who needs accuracy when you can have glowing, heat-seeking lasers of doom? Magic Missile is like having a bunch of tiny, overenthusiastic fireflies with a vendetta. ",
            "effect": "Fires multiple homing energy bolts from the caster's eyes.",
            "range": "120 feet",
            "damageamount": "1d4+1 force damage per missile",
            "damagetype": "Force",
            "castingtime": "1 action",
            "manapointcost": "3-6 AP (variable at level 5+)",
            "cooldown": "1 turn",
            "scaling": "Level 5: Can choose AP cost (3-6) to determine number of missiles<br>Level 10: 25% chance to set targets on fire (1d4 fire damage per round)<br>Level 15: Missiles can ricochet to hit additional targets",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-minionarmy": {
            "name": "Scroll of Minion Army",
            "description": " Ever dreamed of having your own personal flash mob, but for evil? Minion Army is like hosting a \"Villains Anonymous\" meeting and then convincing everyone to join your multi-level marketing scheme! ",
            "effect": "Turns nearby intelligent monsters into temporary allies.",
            "range": "30 meter diameter circle centered on the caster",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "5 minutes (4 minutes at higher levels)",
            "manapointcost": "50 MP",
            "cooldown": "5 hours",
            "scaling": "Level 5: Increase affected area and conversion chance<br>Level 10: Minions gain a strength boost while under your control<br>Level 15: Can affect higher-level creatures with increased success rate",
            "spellcastingmodifier": "Charisma"
        },
        "scroll-mute": {
            "name": "Scroll of Mute",
            "description": "Ever wished you could hit the mute button on that one person who just won't stop talking? Mute is like a magical roll of duct tape for your enemy's mouth!",
            "effect": "Prevents the target from casting spells or using verbal abilities.",
            "range": "60 feet",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "3 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Increase duration to 2 minutes<br>Level 10: Can target multiple creatures within range<br>Level 15: Also prevents the target from making any sound at all",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-ping": {
            "name": "Scroll of Ping",
            "description": " Also known as, \"Here piggy, piggy,\" or \"The Night Dread,\" Ping is a hunting and artillery-aiming tool for those who do not care if their quarry knows they're coming. ",
            "effect": "Reveals the location of creatures within a large area around the caster.",
            "range": "1 kilometer + 500 meters per 10 points of Intelligence",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "Instantaneous",
            "manapointcost": "5 MP",
            "cooldown": "5 minutes",
            "scaling": "Level 5: Provides more detailed information about detected creatures<br>Level 10: Can distinguish between friend and foe<br>Level 15: Can detect invisible or hidden creatures",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-protectiveshell": {
            "name": "Scroll of Protective Shell",
            "description": " Picture yourself in high school. Now picture all the girls who would never get anywhere near you. It's kind of like that, but on purpose. ",
            "effect": "Creates a stationary sphere that blocks physical attacks and creatures.",
            "range": "3-meter radius sphere + 50cm per Intelligence level",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "Item based (no mana cost)",
            "cooldown": "30 hours",
            "scaling": "Level 5: Increase duration to 10 seconds + 1 second per spell level<br>Level 10: Shell also blocks non-magical projectiles<br>Level 15: Can move the shell at half your movement speed",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-puddlejumper": {
            "name": "Scroll of Puddle Jumper",
            "description": " Ever wanted to make a dramatic exit without having to walk all the way to the door? Puddle Jumper is like having a personal \"Nope!\" button for awkward situations. ",
            "effect": "Teleports the caster and up to three others to a visible surface.",
            "range": "Line of sight (distance increases with level)",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action (10-second delay at level 1)",
            "manapointcost": "20 MP",
            "cooldown": "5 hours",
            "scaling": "Level 5: Reduce casting delay to 5 seconds<br>Level 10: Can teleport up to six creatures<br>Level 15: No delay on teleportation",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-reversegravity": {
            "name": "Scroll of Reverse Gravity",
            "description": " Ever wanted to turn the world upside down, literally? Reverse Gravity is like playing \"The Floor is Lava,\" except the ceiling is lava, and also the new floor. ",
            "effect": " Reverses gravity in a limited area, causing creatures and objects to fall upwards. ",
            "range": "50-foot cube within 100 feet",
            "damageamount": "Falling damage when spell ends",
            "damagetype": "Bludgeoning",
            "castingtime": "1 action",
            "manapointcost": "7 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Increase affected area to 75-foot cube<br>Level 10: Can selectively choose which objects are affected<br>Level 15: Can change the direction of gravity at will within the affected area",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-rigorous": {
            "name": "Scroll of Rigorous",
            "description": " Ever wished you could give someone a taste of their own medicine, but like, literally? Rigorous is like having a magical \"I'm rubber, you're glue\" shield. ",
            "effect": "Reflects debuffs and negative conditions back to the caster.",
            "range": "Self",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 reaction",
            "manapointcost": "4 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Duration increases to 2 rounds<br>Level 10: Also grants resistance to the reflected effect<br>Level 15: Can choose to reflect or absorb the effect",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-secondchance": {
            "name": "Scroll of Second Chance",
            "description": "Ever wanted to be the necromancer equivalent of a little league coach? Second Chance is like running a daycare for the recently deceased!",
            "effect": "Raises a lower-level monster from the dead as an undead minion.",
            "range": "Touch",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "6 MP",
            "cooldown": "10 minutes",
            "scaling": "Level 5: Can raise creatures up to 5 levels higher than caster<br>Level 10: Raised creatures retain more of their original abilities<br>Level 15: Can raise multiple creatures at once",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-selfimmolation": {
            "name": "Scroll of Self-Immolation",
            "description": "Casts a non-static sphere of Sheol Fire around the caster with a 1-foot buffer from all body parts of caster.",
            "effect": "Surrounds the caster with an extremely destructive fire.",
            "range": " Self (1.5 meters per level, up to level 15) ",
            "damageamount": "Extreme fire damage to everything in range",
            "damagetype": "Fire (Sheol Fire)",
            "castingtime": "Instantaneous",
            "manapointcost": "None (requires Emberus' favor)",
            "cooldown": "24 hours",
            "scaling": "Level 5: Can control the shape of the fire<br>Level 10: Fire can selectively avoid allies<br>Level 15: Range increases exponentially and becomes fully controllable",
            "spellcastingmodifier": "Stamina"
        },
        "scroll-shatter": {
            "name": "Scroll of Shatter",
            "description": "Any attack that lands upon the object imbued with this enchantment has a 1.5% chance to disarm the opponent.",
            "effect": "Enchants an object to potentially disarm attackers.",
            "range": "Touch",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "3 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Increase disarm chance to 3%<br>Level 10: Increase chance of weapon breaking or transferring to 10% each<br>Level 15: Can affect multiple objects at once",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-shield": {
            "name": "Scroll of Shield",
            "description": "Ever wanted to cosplay as a turtle, but without the slow movement and weird shell tan lines? Shield is like having your own personal bubble boy suit, but instead of protecting you from germs, it's saving your bacon from angry pointy things! ",
            "effect": "Creates a protective barrier around the caster that moves with them.",
            "range": "Self",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 reaction",
            "manapointcost": "2 MP",
            "cooldown": "1 turn",
            "scaling": "Level 5: Shield also provides resistance to elemental damage<br>Level 10: Can extend shield to protect one nearby ally<br>Level 15: Shield can reflect some damage back to attacker",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-skedaddle": {
            "name": "Scroll of Skedaddle",
            "description": "Ever been at a party and suddenly remembered you left the magical oven on? Skedaddle is like having a \"Get Out of Awkward Situation Free\" card, but for your whole group! ",
            "effect": "Teleports the group to a random location they've been within the last hour.",
            "range": "Affects entire party",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "8 MP",
            "cooldown": "1 hour",
            "scaling": "Level 5: Can choose from three random locations<br>Level 10: Extend time frame to locations visited in last 24 hours<br>Level 15: Can bring one additional non-party member",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-suppuratingeye": {
            "name": "Scroll of Suppurating Eye",
            "description": "Ever wanted to be the ultimate peeping tom, but with more ooze and less legal consequences? Suppurating Eye is like having a really gross, really effective spy camera! ",
            "effect": "Creates a remote viewing sensor from the caster's bodily fluid.",
            "range": "Sight and sound from fluid location",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 minute",
            "manapointcost": "3 MP",
            "cooldown": "None",
            "scaling": "Level 5: Can hear thoughts of creatures near the fluid<br>Level 10: Can cast spells through the fluid location<br>Level 15: Can create multiple eyes simultaneously",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-teleporttostairwell": {
            "name": "Scroll of Teleport to Stairwell",
            "description": "Stuck in the dungeon's eternal IKEA and can't find the exit? Teleport to Stairwell is like having a magical \"You Are Here\" map, except the \"You\" part is more of a suggestion than a fact. ",
            "effect": "Teleports the caster to a chosen exit.",
            "range": "Any known stairwell or exit",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "10 MP",
            "cooldown": "25 days",
            "scaling": "Level 20: Can bring along up to 5 allies<br>Level 25: Can teleport to any previously visited location, not just exits<br>Level 30: No cooldown, but increases AP cost to 20 ",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-torch": {
            "name": "Scroll of Torch",
            "description": "Who needs a flashlight when you can have a personal, floating sun? Torch is like having a loyal firefly the size of a basketball! ",
            "effect": "Creates a floating orb of light that follows the caster.",
            "range": " 20-foot radius of bright light, 20 additional feet of dim light ",
            "damageamount": "N/A (except to vampires at higher levels)",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "1 MP",
            "cooldown": "None",
            "scaling": "Level 5: Can adjust brightness and color of light<br>Level 10: Can send light orb up to 60 feet away<br>Level 13: Can stun vampires and set their heads aflame",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-tripper": {
            "name": "Scroll of Tripper",
            "description": "A lot of people say crawlers who use this spell are chickenshit cowards. But then again, those same people are sitting at home covered in Cheeto mud watching this show while wearing pajamas. ",
            "effect": "Triggers all traps in a certain radius.",
            "range": "10-meter radius + 10 meters per Intelligence level",
            "damageamount": "Varies based on traps triggered",
            "damagetype": "Varies",
            "castingtime": "1 action",
            "manapointcost": "Item based (no mana cost)",
            "cooldown": "1 hour",
            "scaling": "Level 5: Can choose which type of traps to trigger<br>Level 10: Can redirect some trap effects<br>Level 15: Can create temporary magical traps in addition to triggering existing ones",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-twinkletoes": {
            "name": "Scroll of Twinkle Toes",
            "description": "Ever wished your lumbering golem moved less like a rusty garbage truck and more like a caffeinated squirrel? Twinkle Toes is like strapping rocket skates to your minions!",
            "effect": "Dramatically increases a minion's movement speed.",
            "range": "Touch",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 bonus action",
            "manapointcost": "2 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Also increases minion's Dexterity for the duration<br>Level 10: Can affect up to three minions at once<br>Level 15: Minions can run on vertical surfaces and water for the duration",
            "spellcastingmodifier": "Dexterity"
        },
        "scroll-walloffire": {
            "name": "Scroll of Wall of Fire",
            "description": "Ever wanted to recreate that \"This is fine\" meme in real life? Wall of Fire is like drawing a line in the sand, if the line was made of \"NOPE\" and the sand was highly flammable! ",
            "effect": "Creates a wall of magical fire that damages creatures passing through it.",
            "range": "120 feet",
            "damageamount": "5d8 fire damage",
            "damagetype": "Fire",
            "castingtime": "1 action",
            "manapointcost": "15 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Wall can be up to 20 feet high and 60 feet long<br>Level 10: Damage increases to 7d8, and the wall ignites flammable objects<br>Level 15: Can shape the wall into a ring or dome ",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-waterlily": {
            "name": "Scroll of Water Lily",
            "description": "Looking for a way to make your enemies take a permanent nap? Water Lily is like the magical version of a really intense, never-ending ASMR session! ",
            "effect": "Renders the target unconscious until the caster cancels the spell or dies.",
            "range": "Touch",
            "damageamount": "N/A (but target takes damage if moved)",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "8 MP",
            "cooldown": "24 hours",
            "scaling": "Level 5: Can affect targets up to 30 feet away<br>Level 10: Can put multiple targets to sleep simultaneously<br>Level 15: Sleeping target is surrounded by a damaging water barrier",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-whyareyouhittingyourself": {
            "name": "Scroll of Why Are You Hitting Yourself",
            "description": "Ever wanted to recreate that classic big sibling move, but with magic? Why Are You Hitting Yourself is like being a puppet master, but the puppet is your enemy and the show is a slapstick comedy! ",
            "effect": "Forces the target to attack themselves.",
            "range": "30 feet",
            "damageamount": "Varies based on target's own attack",
            "damagetype": "Varies",
            "castingtime": "1 action",
            "manapointcost": "4 MP",
            "cooldown": "1 minute",
            "scaling": "Level 5: Duration increases to 2 rounds<br>Level 10: Can affect multiple targets<br>Level 15: Target uses their most powerful ability on themselves",
            "spellcastingmodifier": "Manipulation"
        },
        "scroll-wingsofthepixie": {
            "name": "Scroll of Wings of the Pixie",
            "description": "Ever wanted to make a dramatic exit that's equal parts majestic and mischievous? Wings of the Pixie is like strapping a jet pack to a glitter bomb!",
            "effect": "Grants the caster temporary flight and a speed boost.",
            "range": "Self",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 bonus action",
            "manapointcost": "3 MP",
            "cooldown": "5 minutes",
            "scaling": "Level 5: Leave a trail of disorienting pixie dust behind you as you fly<br>Level 10: Can carry one additional creature while flying<br>Level 15: Gain the ability to teleport short distances while the wings are active",
            "spellcastingmodifier": "Dexterity"
        },
        "scroll-wisparmor": {
            "name": "Scroll of Wisp Armor",
            "description": "Surrounds your body with tendrils of light. While ineffective against physical attacks, this spell negates 75% of incoming damage from magic-based attacks. ",
            "effect": "Creates a protective layer of light that defends against magic and mind control.",
            "range": "Self",
            "damageamount": "N/A",
            "damagetype": "N/A",
            "castingtime": "1 action",
            "manapointcost": "5 MP",
            "cooldown": "5 minutes",
            "scaling": "Level 5: Also provides a slight physical damage reduction<br>Level 10: Can extend the effect to one nearby ally<br>Level 15: Reflects 25% of negated magic damage back to the attacker",
            "spellcastingmodifier": "Intelligence"
        },
        "scroll-zerzura": {
            "name": "Scroll of Zerzura",
            "description": "Ever felt like your whole town could use a change of scenery? Zerzura is like playing a cosmic game of Monopoly, but instead of houses, you're moving entire settlements! ",
            "effect": "Teleports an entire settlement to a random location on a lower floor.",
            "range": "Affects an entire city or town",
            "damageamount": "N/A (but creates powerful revenants where it lands)",
            "damagetype": "N/A",
            "castingtime": "5 minutes",
            "manapointcost": "50 MP",
            "cooldown": "Can only be cast once at the end of a floor",
            "scaling": "Level 10: Can choose from three potential landing spots<br>Level 20: Can bring along some surrounding territory<br>Level 30: Can target a specific location instead of random placement",
            "spellcastingmodifier": "Intelligence"
        }
    }
}